nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]                    # 0  P1/2
  - [-1, 1, Conv, [128, 3, 2]]                   # 1  P2/4
  - [-1, 2, C3k2-TCF, [256, False, 0.25]]    # 2  P2 
  - [-1, 1, Conv, [256, 3, 2]]                   # 3  P3/8
  - [-1, 2, C3k2-TCF, [512, False, 0.25]]    # 4  P3 
  - [-1, 1, Conv, [512, 3, 2]]                   # 5  P4/16
  - [-1, 2, C3k2-TCF, [512, True]]           # 6  P4 
  - [-1, 1, Conv, [1024, 3, 2]]                  # 7  P5/32
  - [-1, 2, C3k2-TCF, [1024, True]]          # 8
  - [-1, 1, SPPF, [1024, 5]]                     # 9
  - [-1, 2, C2PSA, [1024]]                       # 10 P5 

head:
  - [10, 1, Conv,   [256, 1, 1]]   # 11  P5_ctx
  - [6,  1, Conv,   [256, 1, 1]]   # 12  P4_in
  - [4,  1, Conv,   [256, 1, 1]]   # 13  P3_in
  - [2,  1, Conv, [256, 1, 1]]   # 14  P2_in

  # ── Top-Down：P5_ctx → P4_td → P3_td → P2_td ───────────────
  # P4_td = CIF(P4_in, Upsample(P5_ctx))
  - [11, 1, nn.Upsample, [None, 2, "nearest"]]   # 15  P5_ctx ×2 → P4 
  - [[15, 12], 1, CIF, [256]]              # 16  P4_td
  - [-1,       1, C3k2, [256]]                   # 17  P4_td refined

  # P3_td = CIF(P3_in, Upsample(P4_td))
  - [17, 1, nn.Upsample, [None, 2, "nearest"]]   # 18  P4_td ×2 → P3 
  - [[18, 13], 1, CIF, [256]]              # 19  P3_td
  - [-1,       1, C3k2, [256]]                   # 20  P3_td refined

  # P2_td = CIF(P2_in, Upsample(P3_td))
  - [20, 1, nn.Upsample, [None, 2, "nearest"]]   # 21  P3_td ×2 → P2 尺寸
  - [[21, 14], 1, CIF, [256]]              # 22  P2_td
  - [-1,       1, C3k2, [256]]                   # 23  P2_out 

  # ── Bottom-Up：P2_out → P3_out → P4_out ─────────────────────
  # P3_out = CIF(P3_in, P3_td, Downsample(P2_out))
  - [23, 1, Conv, [256, 3, 2]]                   # 24  P2_out ÷2 → P3 
  - [[24, 20, 13], 1, CIF, [256]]          # 25  P3_out
  - [-1,           1, C3k2, [256]]               # 26  P3_out

  # P4_out = CIF(P4_in, P4_td, Downsample(P3_out))
  - [26, 1, Conv, [256, 3, 2]]                   # 27  P3_out ÷2 → P4 
  - [[27, 17, 12], 1, CIF, [256]]          # 28  P4_out
  - [-1,           1, C3k2, [256]]               # 29  P4_out 

  # ── Detect Head：P2/P3/P4，无 P5 ────────────────────────────────
  - [[23, 26, 29], 1, DD-Head, [nc]]              # 30  Detect(stride 4, 8, 16)
